[
  {
    "slug": "product-showcase",
    "title": {
      "en": "E-com Showcase",
      "ru": "E-com Витрина"
    },
    "summary": {
      "en": "E-commerce frontend demo: advanced filters, favorites, and CRUD flows",
      "ru": "E-commerce фронтенд демо: фильтры, избранное и CRUD-сценарии"
    },
    "description": {
      "en": "Frontend demo in an e-commerce domain: advanced filtering, favorites, and CRUD flows with fast UI feedback. Built with Feature-Sliced Design and a production-style UI architecture.",
      "ru": "Фронтенд-демо в e-commerce: продвинутая фильтрация, избранное и CRUD-сценарии с быстрым UI-фидбеком. Архитектура Feature-Sliced Design и production-style подход к UI."
    },
    "status": "completed",
    "featured": true,
    "role": {
      "en": "Frontend Developer",
      "ru": "Фронтенд разработчик"
    },
    "highlights": [
      {
        "en": "Feature-Sliced Design (FSD) structure with clear boundaries and scalable composition",
        "ru": "Feature-Sliced Design (FSD): чёткие границы слоёв и масштабируемая композиция"
      },
      {
        "en": "E2E and unit testing setup: Playwright + Vitest (core flows covered)",
        "ru": "Тестовая база: Playwright + Vitest (покрыты ключевые сценарии)"
      },
      {
        "en": "Performance-minded UI: memoization, list rendering, and predictable state updates",
        "ru": "Производительность UI: мемоизация, рендер списков и предсказуемые обновления состояния"
      }
    ],
    "tags": {
      "domain": ["E-commerce"],
      "tech": [
        "Next.js",
        "React",
        "TypeScript",
        "Redux",
        "RTK Query",
        "Zod",
        "Tailwind",
        "Radix",
        "Vitest",
        "Playwright"
      ],
      "architecture": ["FSD", "Redux"]
    },
    "urls": {
      "demo": "https://prod-show-case.vercel.app",
      "github": "https://github.com/quterma/prod-show-case"
    },
    "images": []
  },
  {
    "slug": "progis-map-app",
    "title": {
      "en": "GIS Mapping App",
      "ru": "GIS-приложение"
    },
    "summary": {
      "en": "Interactive GIS frontend with WMS layers and zoom-aware feature identification",
      "ru": "Интерактивный GIS-фронтенд с WMS-слоями и адаптивной идентификацией"
    },
    "description": {
      "en": "Frontend-focused GIS demo for interactive map rendering and geospatial data visualization. Supports WMS/OGC layers, layer management, and smart feature identification that adapts to the current zoom level. Built with a clean modular architecture and strong emphasis on maintainability and developer experience.",
      "ru": "Фронтенд-демо GIS-приложения для интерактивных карт и визуализации геоданных. Поддерживает WMS/OGC-слои, управление слоями и умную идентификацию объектов, адаптирующуюся к текущему уровню зума. Реализовано с чистой модульной архитектурой и акцентом на поддерживаемость и удобство разработки."
    },
    "status": "in-progress",
    "featured": false,
    "role": {
      "en": "Frontend Developer",
      "ru": "Фронтенд разработчик"
    },
    "highlights": [
      {
        "en": "Layer-based GIS architecture with zoom-dependent feature identification",
        "ru": "Слойная GIS-архитектура с идентификацией объектов, зависящей от уровня зума"
      },
      {
        "en": "Clear separation between map infrastructure and UI logic",
        "ru": "Чёткое разделение инфраструктуры карты и UI-логики"
      },
      {
        "en": "Well-documented codebase with extensive JSDoc for maintainability",
        "ru": "Хорошо документированный код с подробным JSDoc для удобной поддержки"
      }
    ],
    "tags": {
      "domain": ["GIS"],
      "tech": ["React", "TypeScript", "Leaflet", "WMS", "OGC", "OpenStreetMap"],
      "architecture": ["Clean architecture"]
    },
    "urls": {
      "demo": "https://quterma.github.io/progis-map-app",
      "github": "https://github.com/quterma/progis-map-app"
    },
    "images": []
  },
  {
    "slug": "trading-mini-app",
    "title": {
      "en": "Trading Widget",
      "ru": "Торговый виджет"
    },
    "summary": {
      "en": "Mobile-first trading widget with wallet state and real-time charts",
      "ru": "Торговый виджет с кошельком и графиками в реальном времени"
    },
    "description": {
      "en": "Frontend demo of an embeddable trading widget designed for mobile-first usage. Implements hook-based state management without external stores, real-time charting for 24h data, and a clean public API pattern for easy integration and extension.",
      "ru": "Фронтенд-демо встраиваемого торгового виджета, спроектированного по mobile-first подходу. Реализует управление состоянием на хуках без внешнего стора, графики в реальном времени за 24 часа и чистый паттерн публичного API для простой интеграции и расширения."
    },
    "status": "in-progress",
    "featured": false,
    "role": {
      "en": "Frontend Developer",
      "ru": "Фронтенд разработчик"
    },
    "highlights": [
      {
        "en": "Minimal Feature-Sliced Design setup for small, focused widgets",
        "ru": "Минимальная настройка Feature-Sliced Design для компактных виджетов"
      },
      {
        "en": "Hook-based state management without external state libraries",
        "ru": "Управление состоянием на хуках без внешних библиотек состояния"
      },
      {
        "en": "Embed-friendly architecture with a clear public API",
        "ru": "Архитектура, удобная для встраивания, с чётким публичным API"
      }
    ],
    "tags": {
      "domain": ["Trading"],
      "tech": ["React", "TypeScript", "Recharts", "Tailwind"],
      "architecture": ["Mobile-first"]
    },
    "urls": {
      "github": "https://github.com/quterma/trading-mini-app"
    },
    "images": []
  },
  {
    "slug": "yokai-monitor",
    "title": {
      "en": "Monitoring Dashboard",
      "ru": "Дашборд мониторинга"
    },
    "summary": {
      "en": "Real-time monitoring dashboard with SSE streaming and optimistic UI updates",
      "ru": "Дашборд мониторинга с SSE и оптимистичными обновлениями UI"
    },
    "description": {
      "en": "Frontend-focused monitoring dashboard demonstrating real-time UI synchronization and resilient interaction patterns. Uses Server-Sent Events for live updates, optimistic actions with rollback on errors, and automatic reconnection handling. Built with strict Feature-Sliced Design layering, typed event models, and a Dockerized local environment.",
      "ru": "Фронтенд-ориентированный дашборд мониторинга, демонстрирующий синхронизацию UI в реальном времени и устойчивые паттерны взаимодействия. Использует Server-Sent Events для live-обновлений, оптимистичные действия с откатом при ошибках и автоматическое переподключение. Реализован со строгой слоистой архитектурой Feature-Sliced Design, типизированными моделями событий и Docker-окружением для локального запуска."
    },
    "status": "completed",
    "featured": true,
    "role": {
      "en": "Frontend Developer",
      "ru": "Фронтенд разработчик"
    },
    "highlights": [
      {
        "en": "Strict Feature-Sliced Design architecture with clear layer isolation",
        "ru": "Строгая архитектура Feature-Sliced Design с чёткой изоляцией слоёв"
      },
      {
        "en": "Real-time data streaming via Server-Sent Events with auto-reconnect logic",
        "ru": "Поток данных в реальном времени через Server-Sent Events с логикой авто-переподключения"
      },
      {
        "en": "Optimistic UI updates with controlled rollback on error cases",
        "ru": "Оптимистичные обновления UI с контролируемым откатом при ошибках"
      },
      {
        "en": "Themeable UI using SCSS Modules and CSS custom properties",
        "ru": "Темизируемый UI на SCSS Modules и CSS custom properties"
      }
    ],
    "tags": {
      "domain": ["Monitoring"],
      "tech": [
        "React",
        "Next.js",
        "TypeScript",
        "TanStack Query",
        "Zod",
        "SCSS Modules",
        "Server-Sent Events",
        "Docker"
      ],
      "architecture": ["FSD", "Real-time", "Optimistic UI", "SSE"]
    },
    "urls": {
      "demo": "https://yokai-monitor.vercel.app",
      "github": "https://github.com/quterma/yokai-monitor"
    },
    "images": []
  }
]
